# Spare Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalLoadClassification..::..Spare Property
ElectricalLoadClassification Class See Also
---
Indicates if this load classification is to be used for spare.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public bool Spare { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Spare As Boolean
	Get
```

Visual C++
---
```text
public:
property bool Spare {
	bool get ();
}
```

# See Also
ElectricalLoadClassification Class
Autodesk.Revit.DB.Electrical Namespace